# 7.1. Прокат машин: напишите программу, которая спрашивает у пользователя, какую ма-
# шину он бы хотел взять напрокат. Выведите сообщение с введенными данными (например,
# «Let me see if I can find you a Subaru”).

car = input('Какую машину вы бы хотели взять напрокат? ')
print(f'Let me see if I can find you a {car.title()}.')
