# Человек: используйте словарь для сохранения информации об известном вам человеке.
# Сохраните имя, фамилию, возраст и город, в котором живет этот человек. Словарь
# должен содержать ключи с такими именами, как first_name, last_name, age и city. Выведите
# каждый фрагмент информации, хранящийся в словаре.

person = {
    'first_name': 'Иван',
    'last_name': 'Иванов',
    'age': 30,
    'city': 'Москва'
}

print("Имя:", person['first_name'])
print("Фамилия:", person['last_name'])
print("Возраст:", person['age'])
print("Город:", person['city'])
